
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/NoxianNet/terraform/runs/run-QgPuPuWzuamTQQwZ

Waiting for the plan to start...

Terraform v1.3.1
on linux_amd64
Initializing plugins and modules...
linode_domain_record.portainer_subdomain: Refreshing state... [id=22094688]
linode_domain.signalproxy_master: Refreshing state... [id=1891604]
linode_domain_record.code_subdomain: Refreshing state... [id=22094686]
linode_domain_record.npm_subdomain: Refreshing state... [id=22094687]
linode_instance.reverse_proxy_docker: Refreshing state... [id=39224614]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # cloudflare_zone.heartunit_net will be created
  + resource "cloudflare_zone" "heartunit_net" {
      + id                  = (known after apply)
      + jump_start          = true
      + meta                = (known after apply)
      + name_servers        = (known after apply)
      + paused              = false
      + plan                = (known after apply)
      + status              = (known after apply)
      + type                = "full"
      + vanity_name_servers = (known after apply)
      + verification_key    = (known after apply)
      + zone                = "heartunit.net"
    }

  # linode_domain.signalproxy_master will be destroyed
  # (because linode_domain.signalproxy_master is not in configuration)
  - resource "linode_domain" "signalproxy_master" {
      - domain      = "signalproxy.net" -> null
      - expire_sec  = 0 -> null
      - id          = "1891604" -> null
      - master_ips  = [] -> null
      - refresh_sec = 0 -> null
      - retry_sec   = 0 -> null
      - soa_email   = "linode1@noxian.net" -> null
      - status      = "active" -> null
      - tags        = [
          - "main",
        ] -> null
      - ttl_sec     = 0 -> null
      - type        = "master" -> null
    }

  # linode_domain_record.code_subdomain will be destroyed
  # (because linode_domain_record.code_subdomain is not in configuration)
  - resource "linode_domain_record" "code_subdomain" {
      - domain_id   = 1891604 -> null
      - id          = "22094686" -> null
      - name        = "code" -> null
      - port        = 0 -> null
      - priority    = 0 -> null
      - record_type = "A" -> null
      - target      = "96.126.106.192" -> null
      - ttl_sec     = 0 -> null
      - weight      = 0 -> null
    }

  # linode_domain_record.npm_subdomain will be destroyed
  # (because linode_domain_record.npm_subdomain is not in configuration)
  - resource "linode_domain_record" "npm_subdomain" {
      - domain_id   = 1891604 -> null
      - id          = "22094687" -> null
      - name        = "npm" -> null
      - port        = 0 -> null
      - priority    = 0 -> null
      - record_type = "A" -> null
      - target      = "96.126.106.192" -> null
      - ttl_sec     = 0 -> null
      - weight      = 0 -> null
    }

  # linode_domain_record.portainer_subdomain will be destroyed
  # (because linode_domain_record.portainer_subdomain is not in configuration)
  - resource "linode_domain_record" "portainer_subdomain" {
      - domain_id   = 1891604 -> null
      - id          = "22094688" -> null
      - name        = "portainer" -> null
      - port        = 0 -> null
      - priority    = 0 -> null
      - record_type = "A" -> null
      - target      = "96.126.106.192" -> null
      - ttl_sec     = 0 -> null
      - weight      = 0 -> null
    }

  # linode_instance.reverse_proxy_docker will be destroyed
  # (because linode_instance.reverse_proxy_docker is not in configuration)
  - resource "linode_instance" "reverse_proxy_docker" {
      - authorized_keys   = [
          - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIMetXNx8lLrcCzlY03GLpyhdhgP1mdR9FitZdB0sYYVM",
        ] -> null
      - backups           = [
          - {
              - enabled  = false
              - schedule = [
                  - {
                      - day    = ""
                      - window = ""
                    },
                ]
            },
        ] -> null
      - backups_enabled   = false -> null
      - boot_config_label = "My Ubuntu 22.04 LTS Disk Profile" -> null
      - booted            = true -> null
      - id                = "39224614" -> null
      - image             = "linode/ubuntu22.04" -> null
      - ip_address        = "96.126.106.192" -> null
      - ipv4              = [
          - "96.126.106.192",
        ] -> null
      - ipv6              = "2600:3c03::f03c:93ff:fedc:ad3d/128" -> null
      - label             = "nginx-docker" -> null
      - private_ip        = false -> null
      - region            = "us-east" -> null
      - resize_disk       = false -> null
      - shared_ipv4       = [] -> null
      - specs             = [
          - {
              - disk     = 81920
              - memory   = 4096
              - transfer = 4000
              - vcpus    = 2
            },
        ] -> null
      - status            = "running" -> null
      - swap_size         = 512 -> null
      - tags              = [
          - "docker",
          - "nginx",
          - "reverse-proxy",
        ] -> null
      - type              = "g6-standard-2" -> null
      - watchdog_enabled  = true -> null

      - alerts {
          - cpu            = 180 -> null
          - io             = 10000 -> null
          - network_in     = 10 -> null
          - network_out    = 10 -> null
          - transfer_quota = 80 -> null
        }

      - config {
          - kernel       = "linode/grub2" -> null
          - label        = "My Ubuntu 22.04 LTS Disk Profile" -> null
          - memory_limit = 0 -> null
          - root_device  = "/dev/sda" -> null
          - run_level    = "default" -> null
          - virt_mode    = "paravirt" -> null

          - devices {
              - sda {
                  - disk_id    = 78629072 -> null
                  - disk_label = "Ubuntu 22.04 LTS Disk" -> null
                  - volume_id  = 0 -> null
                }

              - sdb {
                  - disk_id    = 78629073 -> null
                  - disk_label = "512 MB Swap Image" -> null
                  - volume_id  = 0 -> null
                }
            }

          - helpers {
              - devtmpfs_automount = true -> null
              - distro             = true -> null
              - modules_dep        = true -> null
              - network            = true -> null
              - updatedb_disabled  = true -> null
            }
        }

      - disk {
          - authorized_keys  = [] -> null
          - authorized_users = [] -> null
          - filesystem       = "ext4" -> null
          - id               = 78629072 -> null
          - label            = "Ubuntu 22.04 LTS Disk" -> null
          - read_only        = false -> null
          - size             = 81408 -> null
          - stackscript_data = (sensitive value)
          - stackscript_id   = 0 -> null
        }
      - disk {
          - authorized_keys  = [] -> null
          - authorized_users = [] -> null
          - filesystem       = "swap" -> null
          - id               = 78629073 -> null
          - label            = "512 MB Swap Image" -> null
          - read_only        = false -> null
          - size             = 512 -> null
          - stackscript_data = (sensitive value)
          - stackscript_id   = 0 -> null
        }
    }

Plan: 1 to add, 0 to change, 5 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "LINODE_TOKEN" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-QgPuPuWzuamTQQwZ/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pushed by: @TheNite, Action: `pull_request`*